project/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>notes</title>
<!-- 2015-06-02 Tue 22:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Bender" />
</head>
<body>
<div id="content">
<h1 class="title">notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. plan for project</a></li>
<li><a href="#sec-2">2. impl.</a></li>
<li><a href="#sec-3">3. results</a>
<ul>
<li><a href="#sec-3-1">3.1. initial attempt to turn test assumptions into documentation</a></li>
<li><a href="#sec-3-2">3.2. second attempt to refactor tests for better documentation</a></li>
<li><a href="#sec-3-3">3.3. reduced ambition</a></li>
<li><a href="#sec-3-4">3.4. translate to proof format</a></li>
<li><a href="#sec-3-5">3.5. views on tests</a></li>
</ul>
</li>
<li><a href="#sec-4">4. output of hacked rspec/mocha:</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> plan for project</h2>
<div class="outline-text-2" id="text-1">
<p>
Two test suites:
</p>

<p>
Puppet (ruby, rspec mocks), example:
</p>

<div class="org-src-container">

<pre class="src src-ruby">describe <span style="color: #00cdcd;">'ClassifierUtils'</span> <span style="color: #00cd00;">do</span>
  it <span style="color: #00cdcd;">"logs output from the http connection attempt"</span> <span style="color: #00cd00;">do</span>
    <span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">tests and mocks/stubs (raises/returns called on the expectation)</span>
    <span style="color: #cdcd00;">TCPSocket</span>.expects(<span style="color: #00cdcd;">:open</span>).raises(<span style="color: #00cdcd;">'no-connection'</span>)
    <span style="color: #cdcd00;">OpenSSL</span>::<span style="color: #cdcd00;">X509</span>::<span style="color: #cdcd00;">Certificate</span>.expects(<span style="color: #00cdcd;">:new</span>).with(<span style="color: #00cdcd;">'certkey'</span>).returns(stub(<span style="color: #00cdcd;">'cert'</span>))
    <span style="color: #cdcd00;">OpenSSL</span>::<span style="color: #cdcd00;">PKey</span>::<span style="color: #cdcd00;">RSA</span>.expects(<span style="color: #00cdcd;">:new</span>).with(<span style="color: #00cdcd;">'certkey'</span>, <span style="color: #0000ee;">nil</span>).returns(stub(<span style="color: #00cdcd;">'key'</span>)

    <span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">tests</span>
    expect { handle.get(<span style="color: #00cdcd;">'/hi'</span>) }.to raise_error(<span style="color: #00cdcd;">'no-connection'</span>)
    expect(testcase.logger.destination.string).to match(<span style="color: #00cdcd;">/opening connection to foo/</span>)
  <span style="color: #00cd00;">end</span>
<span style="color: #00cd00;">end</span>
</pre>
</div>

<p>
Discourse (ruby, rspec mocks), example:
</p>

<div class="org-src-container">

<pre class="src src-ruby">describe <span style="color: #cdcd00;">CommonPasswords</span> <span style="color: #00cd00;">do</span>
  describe <span style="color: #00cdcd;">'#password_list'</span> <span style="color: #00cd00;">do</span>
    it <span style="color: #00cdcd;">"loads the passwords file if redis doesn't have it"</span> <span style="color: #00cd00;">do</span>
      <span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">mocks/stubs</span>
      mock_redis = mock(<span style="color: #00cdcd;">"redis"</span>)
      mock_redis.stubs(<span style="color: #00cdcd;">:exists</span>).returns(<span style="color: #0000ee;">false</span>)
      mock_redis.stubs(<span style="color: #00cdcd;">:scard</span>).returns(0)
      described_class.stubs(<span style="color: #00cdcd;">:redis</span>).returns(mock_redis)

      <span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">test</span>
      described_class.expects(<span style="color: #00cdcd;">:load_passwords</span>).returns([<span style="color: #00cdcd;">'password'</span>])
      list = described_class.password_list
      expect(list).to respond_to(<span style="color: #00cdcd;">:include?</span>)
    <span style="color: #00cd00;">end</span>
  <span style="color: #00cd00;">end</span>
<span style="color: #00cd00;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> impl.</h2>
<div class="outline-text-2" id="text-2">
<p>
write down mocks/stubs
try to follow some method to compute the documentationg
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> results</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> initial attempt to turn test assumptions into documentation</h3>
<div class="outline-text-3" id="text-3-1">
<p>
assumptions are complicated and large
the code (not surprisingly) doesn't translate well into docs
CategoryList example from discourse
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> second attempt to refactor tests for better documentation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
note how the first attempt at documenting tests fueled refactor
assume, prove blocks
refactoring
output is still convoluted
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> reduced ambition</h3>
<div class="outline-text-3" id="text-3-3">
<p>
just hide all tests
examine only the assumptions, test descriptions
can infer a lot from assumptions and test descriptions
e.g. `educate<sub>until</sub><sub>posts`</sub> and "returns a message for user who has not posted any topics"
  implies that educate<sub>until</sub><sub>posts</sub> is a threshold for returning a message
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> translate to proof format</h3>
<div class="outline-text-3" id="text-3-4">
<p>
ComposerMessageFinder examples
"defactor"/"distribute" assumptions
segregate actual proof from assumptions
distinction between proof and assumptions
</p>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> views on tests</h3>
<div class="outline-text-3" id="text-3-5">
<p>
hide actual tests, only show assumptions
defactor assumptions into each test
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> output of hacked rspec/mocha:</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-bash">vagrant@precise32:/vagrant$ bundle exec rspec --format d spec/components/composer_messages_finder_spec.rb

ComposerMessagesFinder
  delegates work
    `user` exists
    `finder` exists
    `finder`, when sent `check_education_message`
    `finder`, when sent `check_new_user_many_replies`
    `finder`, when sent `check_avatar_notification`
    `finder`, when sent `check_sequential_replies`
    `finder`, when sent `check_dominating_topic`
    `finder`, when sent `check_reviving_old_topic`
    |=
    `finder` calls all the message finders

  .check_education_message
    creating topic
      `user` exists
      `finder` exists
      SiteSetting, when sent `educate_until_posts` returns 10
      `user`, when sent `created_topic_count` returns 9
      |=
      `finder` returns a message for a user who has not posted any topics

      `user` exists
      `finder` exists
      SiteSetting, when sent `educate_until_posts` returns 10
      `user`, when sent `created_topic_count` returns 10
      |=
      `finder` returns no message when the user has posted enough topics

    creating reply
      `user` exists
      `finder` exists
      SiteSetting, when sent `educate_until_posts` returns 10
      `user`, when sent `post_count` returns 9
      |=
      `finder` returns a message for a user who has not posted any topics

      `user` exists
      `finder` exists
      SiteSetting, when sent `educate_until_posts` returns 10
      `user`, when sent `post_count` returns 10
      |=
      `finder` returns no message when the user has posted enough topics

  .check_new_user_many_replies
    replying
      `user` exists
      `finder` exists
      `user`, when sent `posted_too_much_in_topic?` returns false
      |=
      `finder` has no message when `posted_too_much_in_topic?` is false

      `user` exists
      `finder` exists
      `user`, when sent `posted_too_much_in_topic?` returns true
      |=
      `finder` has a message when a user has posted too muchjj


Finished in 0.39291 seconds
5 examples, 0 failures
</pre>
</div>

<div class="org-src-container">

<pre class="src src-bash">vagrant@precise32:/vagrant$ bundle exec rspec --format d spec/components/composer_messages_finder_spec.rb

ComposerMessagesFinder
  delegates work
    calls all the message finders
  .check_education_message
    creating topic
      returns a message for a user who has not posted any topics
      returns no message when the user has posted enough topics
    creating reply
      returns a message for a user who has not posted any topics
      returns no message when the user has posted enough topics
  .check_new_user_many_replies
    replying
      has no message when `posted_too_much_in_topic?` is false
      has a message when a user has posted too much
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Bender</p>
<p class="date">Created: 2015-06-02 Tue 22:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
